# DefaultIFCProjectTemplate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..DefaultIFCProjectTemplate Property
Application Class See Also
---
Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string DefaultIFCProjectTemplate { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DefaultIFCProjectTemplate As String
	Get
```

Visual C++
---
```text
public:
property String^ DefaultIFCProjectTemplate {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace